qgis_server/test_1_oaf_20240210T160958_hetzner_ccx23/report/statistics.json
{
  "1" : {
    "transaction" : "1",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 233.00000000000009,
    "medianResTime" : 185.0,
    "minResTime" : 103.0,
    "maxResTime" : 1334.0,
    "pct1ResTime" : 388.7000000000003,
    "pct2ResTime" : 473.54999999999967,
    "pct3ResTime" : 1333.7599999999998,
    "throughput" : 4.281188457915918,
    "receivedKBytesPerSec" : 2433.604703822031,
    "sentKBytesPerSec" : 0.8760967200744927
  },
  "2" : {
    "transaction" : "2",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 222.98499999999996,
    "medianResTime" : 177.5,
    "minResTime" : 103.0,
    "maxResTime" : 1784.0,
    "pct1ResTime" : 320.8,
    "pct2ResTime" : 453.84999999999997,
    "pct3ResTime" : 1497.9200000000064,
    "throughput" : 8.696030262185312,
    "receivedKBytesPerSec" : 3777.1619316328974,
    "sentKBytesPerSec" : 1.7792468558415584
  },
  "4" : {
    "transaction" : "4",
    "sampleCount" : 400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 260.7449999999998,
    "medianResTime" : 204.0,
    "minResTime" : 110.0,
    "maxResTime" : 1717.0,
    "pct1ResTime" : 393.90000000000003,
    "pct2ResTime" : 602.0999999999996,
    "pct3ResTime" : 1666.2700000000007,
    "throughput" : 14.547041495435867,
    "receivedKBytesPerSec" : 6765.575917941048,
    "sentKBytesPerSec" : 2.97635452276612
  },
  "16" : {
    "transaction" : "16",
    "sampleCount" : 1600,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 662.622500000002,
    "medianResTime" : 492.0,
    "minResTime" : 108.0,
    "maxResTime" : 10111.0,
    "pct1ResTime" : 1205.4000000000005,
    "pct2ResTime" : 1587.9499999999998,
    "pct3ResTime" : 3352.4400000000005,
    "throughput" : 21.615487496791452,
    "receivedKBytesPerSec" : 10294.50130706151,
    "sentKBytesPerSec" : 4.422784159225085
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 491.14838709677394,
    "medianResTime" : 361.0,
    "minResTime" : 103.0,
    "maxResTime" : 10111.0,
    "pct1ResTime" : 899.9000000000001,
    "pct2ResTime" : 1291.699999999999,
    "pct3ResTime" : 2687.3799999999865,
    "throughput" : 16.279888036382925,
    "receivedKBytesPerSec" : 7704.685841445378,
    "sentKBytesPerSec" : 3.3310228446872423
  },
  "8" : {
    "transaction" : "8",
    "sampleCount" : 800,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 362.71124999999995,
    "medianResTime" : 277.0,
    "minResTime" : 110.0,
    "maxResTime" : 3007.0,
    "pct1ResTime" : 595.0,
    "pct2ResTime" : 775.8499999999998,
    "pct3ResTime" : 2122.4500000000007,
    "throughput" : 18.81025158711498,
    "receivedKBytesPerSec" : 8825.797438021691,
    "sentKBytesPerSec" : 3.8487078973665647
  }
}