qgis_server/test_1_oaf_20240210T204118_hetzner_ccx33/report/statistics.json
{
  "1" : {
    "transaction" : "1",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 216.86999999999995,
    "medianResTime" : 168.0,
    "minResTime" : 104.0,
    "maxResTime" : 1319.0,
    "pct1ResTime" : 351.40000000000003,
    "pct2ResTime" : 442.5999999999997,
    "pct3ResTime" : 1318.9099999999999,
    "throughput" : 4.5987583352494825,
    "receivedKBytesPerSec" : 2614.124565273626,
    "sentKBytesPerSec" : 0.9410837979995401
  },
  "2" : {
    "transaction" : "2",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 213.32000000000005,
    "medianResTime" : 169.0,
    "minResTime" : 102.0,
    "maxResTime" : 1469.0,
    "pct1ResTime" : 311.8000000000001,
    "pct2ResTime" : 482.7499999999997,
    "pct3ResTime" : 1432.8100000000065,
    "throughput" : 9.158347834050737,
    "receivedKBytesPerSec" : 3977.9717586603624,
    "sentKBytesPerSec" : 1.8738391078624415
  },
  "4" : {
    "transaction" : "4",
    "sampleCount" : 400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 245.83000000000004,
    "medianResTime" : 190.0,
    "minResTime" : 98.0,
    "maxResTime" : 1851.0,
    "pct1ResTime" : 392.0,
    "pct2ResTime" : 539.9499999999996,
    "pct3ResTime" : 1697.4200000000005,
    "throughput" : 15.616459748574998,
    "receivedKBytesPerSec" : 7262.943742313773,
    "sentKBytesPerSec" : 3.1951596905012885
  },
  "16" : {
    "transaction" : "16",
    "sampleCount" : 1600,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 643.9175000000016,
    "medianResTime" : 425.0,
    "minResTime" : 118.0,
    "maxResTime" : 13719.0,
    "pct1ResTime" : 1221.4000000000005,
    "pct2ResTime" : 1779.6999999999953,
    "pct3ResTime" : 3694.63,
    "throughput" : 22.922964512385565,
    "receivedKBytesPerSec" : 10917.194820126362,
    "sentKBytesPerSec" : 4.690309406295219
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 470.8429032258052,
    "medianResTime" : 287.0,
    "minResTime" : 98.0,
    "maxResTime" : 13719.0,
    "pct1ResTime" : 891.7000000000003,
    "pct2ResTime" : 1388.7999999999993,
    "pct3ResTime" : 2914.819999999996,
    "throughput" : 17.51729126169703,
    "receivedKBytesPerSec" : 8290.304310622188,
    "sentKBytesPerSec" : 3.5842075350487095
  },
  "8" : {
    "transaction" : "8",
    "sampleCount" : 800,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 333.32750000000044,
    "medianResTime" : 242.0,
    "minResTime" : 104.0,
    "maxResTime" : 2533.0,
    "pct1ResTime" : 567.1999999999998,
    "pct2ResTime" : 794.5499999999994,
    "pct3ResTime" : 2007.4600000000005,
    "throughput" : 21.077036568658446,
    "receivedKBytesPerSec" : 9889.376252478198,
    "sentKBytesPerSec" : 4.3125078215565384
  }
}