qgis_server/test_1_wfs_20240210T155456_hetzner_ccx23/report/statistics.json
{
  "1" : {
    "transaction" : "1",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 214.85000000000002,
    "medianResTime" : 159.0,
    "minResTime" : 79.0,
    "maxResTime" : 1701.0,
    "pct1ResTime" : 375.9,
    "pct2ResTime" : 503.94999999999885,
    "pct3ResTime" : 1700.8799999999999,
    "throughput" : 4.639940608760208,
    "receivedKBytesPerSec" : 5114.702866178313,
    "sentKBytesPerSec" : 0.9948232037629918
  },
  "2" : {
    "transaction" : "2",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 226.5599999999999,
    "medianResTime" : 158.5,
    "minResTime" : 72.0,
    "maxResTime" : 2523.0,
    "pct1ResTime" : 343.80000000000007,
    "pct2ResTime" : 560.7499999999995,
    "pct3ResTime" : 2206.7600000000084,
    "throughput" : 8.59882196139129,
    "receivedKBytesPerSec" : 7185.4606348617735,
    "sentKBytesPerSec" : 1.8433304715378993
  },
  "4" : {
    "transaction" : "4",
    "sampleCount" : 400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 339.1675000000002,
    "medianResTime" : 211.0,
    "minResTime" : 66.0,
    "maxResTime" : 3331.0,
    "pct1ResTime" : 655.8000000000001,
    "pct2ResTime" : 1022.6499999999999,
    "pct3ResTime" : 3130.71,
    "throughput" : 10.930454980188552,
    "receivedKBytesPerSec" : 9784.646766976362,
    "sentKBytesPerSec" : 2.3431362293346085
  },
  "16" : {
    "transaction" : "16",
    "sampleCount" : 1600,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1167.815624999998,
    "medianResTime" : 515.0,
    "minResTime" : 86.0,
    "maxResTime" : 36280.0,
    "pct1ResTime" : 2208.8,
    "pct2ResTime" : 4470.799999999985,
    "pct3ResTime" : 12888.390000000003,
    "throughput" : 11.917175629375839,
    "receivedKBytesPerSec" : 10930.518160018342,
    "sentKBytesPerSec" : 2.5547736202145095
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 825.476774193548,
    "medianResTime" : 374.5,
    "minResTime" : 66.0,
    "maxResTime" : 36280.0,
    "pct1ResTime" : 1516.7000000000003,
    "pct2ResTime" : 2614.0,
    "pct3ResTime" : 7686.799999999996,
    "throughput" : 11.00301340592956,
    "receivedKBytesPerSec" : 10026.03793591122,
    "sentKBytesPerSec" : 2.3587744650672073
  },
  "8" : {
    "transaction" : "8",
    "sampleCount" : 800,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 610.0112500000008,
    "medianResTime" : 356.0,
    "minResTime" : 94.0,
    "maxResTime" : 10655.0,
    "pct1ResTime" : 1233.5,
    "pct2ResTime" : 2113.6499999999915,
    "pct3ResTime" : 4528.970000000002,
    "throughput" : 12.109836214465199,
    "receivedKBytesPerSec" : 10925.898889253656,
    "sentKBytesPerSec" : 2.596016573446157
  }
}